export const ScientificEffectActions = [
	{
		id: 1,
		name: '功能查询',
		des: '选择一个操作和一个要对其执行操的对象。在“查询”按钮右边的按钮选择查询结果类型后，单击“查询”按钮。',
		actions: [
			{
				id: 1,
				name: '操作',
				list: ['吸收','积聚','弯曲','分解','改变','清洁','压缩','集中','浓缩','约束','冷却','堆积','破坏','检测','稀释','干燥','蒸发','扩大','提取','冷冻','加热','保持','连接','融化','混合','移动','指向','产生','保护','提纯','去除','抵抗','旋转','分离','振动']
			},
			{
				id: 2,
				name: '对象',
				list: ['粉末', '场', '气体', '液体', '固体']
			}
		]
	},
	{
		id: 2,
		name: '参数查询',
		des: '选择一个操作和要执行该操作的参数。在“查询”按钮右边的按钮选择查询结果类型后，单击“查询”按钮。',
		actions: [
			{
				id: 3,
				name: '操作',
				list: ['改变','减少','增加','测量','稳定']
			},
			{
				id: 4,
				name: '参数',
				list: ['亮度','颜色','浓度','密度','阻力','电导率','能量','流体流动','力','频率','摩擦力','硬度','热导率','同质性','湿度','长度','磁性','定位/方向性','极化/偏振','孔隙率','位置','功力/功率','压力/压强','纯度','反射率','刚性','形状','声音','速度','强度','表面积','表面光洁度','温度','时间','透明度','振动','粘度','体积/容积','重量']
			}
		]
	},
	{
		id: 3,
		name: '转换查询',
		des: '选择要转换的能量类型和要转换成的能量类型。在“查询”按钮右边的按钮选择查询结果类型后，单击“查询”按钮。',
		actions: [
			{
				id: 5,
				name: '转换自',
				list: ['声学的','化工','电气','电磁','动能的','磁的','机械的','光学的','热的']
			},
			{
				id: 6,
				name: '转换到',
				list: ['声学的','化工','电气','电磁','动能的','磁的','机械的','光学的','热的'],
			}
		]
	},
]

export const getScientificEffectAction = (id) => {
	return ScientificEffectActions[id-1]
}