const arrTrizCommonSense = [
	{
		"title": "TRIZ的诞生",
		"content": 'TRIZ的含义是发明问题解决理论，其拼写是由“发明问题的解决理论”（Theory of Inventive Problem Solving）俄语含义的单词TRIZ是俄文теории решения изобретательских задач 的英文音译Teoriya Resheniya Izobreatatelskikh Zadatch的缩写，其英文全称是Theory of the Solution of Inventive Problems（发明问题解决理论）。在欧美国家也可缩写为TIPS。' + 
		'\n\nTRIZ是基于知识的、面向人的发明问题解决系统化方法学。' +
		'\n\nTRIZ理论是由前苏联发明家阿利赫舒列尔(G. S. Altshuller)在1946年创立的，Altshuller也被尊称为TRIZ之父。1946年，Altshuller开始了发明问题解决理论的研究工作。当时Altshuller在前苏联里海海军的专利局工作，在处理世界各国著名的发明专利过程中，他总是考虑这样一个问题：当人们进行发明创造、解决技术难题时，是否有可遵循的科学方法和法则，从而能迅速地实现新的发明创造或解决技术难题呢？答案是肯定的！Altshuller发现任何领域的产品改进、技术的变革、创新和生物系统一样，都存在产生、生长、成熟、衰老、灭亡，是有规律可循的。人们如果掌握了这些规律，就能能动地进行产品设计并能预测产品的未来趋势。' +
		'以后数十年中，Altshuller穷其毕生的精力致力于TRIZ理论的研究和完善。在他的领导下，前苏联的研究机构、大学、企业组成了TRIZ的研究团体，分析了世界近250万份高水平的发明专利，总结出各种技术发展进化遵循 的规律模式，以及解决各种技术矛盾和物理矛盾的创新原理和法则，建立一个由解决技术，实现创新开发的各种方法、算法组成的综合理论体系，并综合多学科领域 的原理和法则，建立起TRIZ理论体系。'
	},
	{
		"title": "TRIZ核心思想和基本特征",
		"content": '现代TRIZ理论的核心思想主要体现在三个方面：' +
		'\n\n1、无论是一个简单产品还是复杂的技术系统，其核心技术的发展都是遵循着客观的规律发展演变的，即具有客观的进化规律和模式。' +
		'\n\n2、技术系统发展的理想状态是用尽量少的资源实现尽量多的功能。'+
		'\n\n3、各种技术难题、冲突和矛盾的不断解决是推动这种进化过程的动力。'
	},
	{
		"title": "TRIZ的基本哲理",
		"content": 'TRIZ理论的基本哲理包括以下6条:' +
		'\n1、所有的工程系统服从相同的发展规则。这一规则可以用来研究创造发明问题的有效解，也可用来评价与预测如何求解一个工程系统(包括新产品与新服务系统)的解决方案。' +
		'\n2、像社会系统一样，工程系统可以通过解决冲突(Conflicts)而得到发展。' +
		'\n3、任何一个发明或创新的问题都可以表示为需求和不能(或不再能)满足这些需求的原型系统之间的冲突。所以，“求解发明问题”与“寻找发明问题的解决方案”就意味着在利用折衷与调和不能被采纳时对冲突的求解。' +
		'\n4、为探索冲突问题的解决方案，有必要利用专业工程师尚不知道或不熟悉的物理或其它科学与工程的知识。技术功能和可能实现该功能的物理学、化学、生物学等效应对应的分类知识库可以成为探索冲突问题解的指针。' +
		'\n5、存在评价每项发明创造的可靠判据。这些判据是：' +
		'\n    (1)该项发明创造 是否是建立在大量专利信息基础上的?基于偶然发现的少数事例的发明项目不是严肃的研究成果。事实证明，一项重大或重要的发明项目通常是建立在不少于1万到2万项专利(或知产权/版权)研究的基础上。' +
		'\n    (2)发明人或研究者是否考虑过发明问题的级别?大量低水平的发明不如一项或少量高水平的发明。因为，低水平的发明只能在简单的情况下运用。' +
		'\n    (3)该项发明是否是从大量高水平的试验中提炼出来的结论或建议' +
		'\n6、在大多数情况下，理论的寿命与机器的发展规律是-致的。因而，“试凑"法很难产生两种或两种以上的系统解。'
	},
	{
		"title": "TRIZ解决问题的过程",
		"content": '在利用TRIZ解决问题的过程中，设计者首先将待设计的产品表达成为TRIZ问题，然后利用TRIZ中的工具如发明原理、标准解等求出该TRIZ问题的普适解或称模拟解（Analogous solution）最后设计者在把该解转化为领域的解或特解。'
	},
	{
		"title": "TRIZ理论的创新设计问题解决工具",
		"content": '本知识库提供了TRIZ系列的多种工具，如：矛盾矩阵、76个标准解、物-场模型、40个创新原理、39个工程参数以及科学效应库'
	}
]


export default arrTrizCommonSense;